In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import pandas_profiling as pp

In [3]:
df = pd.read_csv("../data/Data_limpia.csv")
df.columns

Index(['company', 'title', 'totalyearlycompensation', 'location',
       'yearsofexperience', 'yearsatcompany', 'tag', 'basesalary',
       'stockgrantvalue', 'bonus', 'gender', 'Race', 'Education'],
      dtype='object')

## Análisis exploratorio de datos (EDA)

In [ ]:
#profile = pp.ProfileReport(df, title='Pandas Profiling Report', minimal=True)
#profile.to_file('../data/reports/Data_salary.html')

#### Preguntas de exploración

1. ¿Qué variables influyen en el valor facturado por los profesionales?
* Salario anual de acuerdo a:
- Nivel de educación
- Género
- Cargo
- Empresa
- Experiencia
2. ¿Cuál es el % de participación por genero en este campo?

In [4]:
salario_anual = df.groupby(['totalyearlycompensation']).mean()
nivel_educacion = df.groupby(['Education','totalyearlycompensation']).size()
nivel_educacion

Education          totalyearlycompensation
Bachelor's Degree  10000                      27
                   11000                      12
                   12000                      22
                   13000                      13
                   14000                      15
                                              ..
Some College       495000                      1
                   510000                      1
                   513000                      1
                   541000                      1
                   586000                      1
Length: 2369, dtype: int64

In [5]:
#Se agrupa por compañía
x_compania = df.groupby(['company']).mean()
x_compania.head()

,totalyearlycompensation,yearsofexperience,yearsatcompany,basesalary,stockgrantvalue,bonus
company,,,,,,
10x Genomics,193333.333333,3.166667,0.666667,149666.666667,27666.666667,15166.666667
23andMe,153428.571429,3.142857,0.857143,116428.571429,17000.000000,0.000000
2U,145571.428571,8.000000,2.428571,129142.857143,3428.571429,13000.000000
3M,112200.000000,6.300000,3.350000,103150.000000,1000.000000,8250.000000
3m,93500.000000,3.500000,1.500000,90000.000000,0.000000,3500.000000

In [6]:
top_company= df["company"].value_counts().reset_index()
top_company.columns = ["company", "totalyearlycompensation"]
top_company

                 company  totalyearlycompensation
0                 Amazon                     7583
1              Microsoft                     4749
2                 Google                     4031
3               Facebook                     2626
4                  Apple                     1934
...                  ...                      ...
1612               ARUBA                        1
1613            fortinet                        1
1614  Nxp semiconductors                        1
1615     GENERAL ATOMICS                        1
1616    tableau software                        1

[1617 rows x 2 columns]

In [7]:
prom_sal_anual = pd.concat([df['totalyearlycompensation'],df['company']], axis = 1)
prom_sal_anual

       totalyearlycompensation     company
0                       127000      Oracle
1                       100000        eBay
2                       310000      Amazon
3                       372000       Apple
4                       157000   Microsoft
...                        ...         ...
58357                   327000      Google
58358                   237000   Microsoft
58359                   220000        MSFT
58360                   280000  Salesforce
58361                   200000       apple

[58362 rows x 2 columns]

In [8]:
df.groupby(['company']).mean()

,totalyearlycompensation,yearsofexperience,yearsatcompany,basesalary,stockgrantvalue,bonus
company,,,,,,
10x Genomics,193333.333333,3.166667,0.666667,149666.666667,27666.666667,15166.666667
23andMe,153428.571429,3.142857,0.857143,116428.571429,17000.000000,0.000000
2U,145571.428571,8.000000,2.428571,129142.857143,3428.571429,13000.000000
3M,112200.000000,6.300000,3.350000,103150.000000,1000.000000,8250.000000
3m,93500.000000,3.500000,1.500000,90000.000000,0.000000,3500.000000
...,...,...,...,...,...,...
zoom,100000.000000,2.000000,6.000000,0.000000,0.000000,0.000000
zoominfo,150000.000000,13.000000,0.000000,145000.000000,5000.000000,0.000000
zoox,228666.666667,10.333333,3.333333,191666.666667,27000.000000,10000.000000
zynga,300000.000000,6.000000,6.000000,200000.000000,50000.000000,50000.000000
Google,91000.000000,5.000000,2.000000,69000.000000,11000.000000,11000.000000